# Задача 1: Вывод "Hello, World!"
print("Hello, World!")

# Задача 2: Приветствие с именем
name = input("Введите ваше имя: ")
print(f"Привет, {name}!")