# Задача 1: Сумма двух чисел
num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))
print(f"Сумма: {num1 + num2}")

# Задача 2: Преобразование строки в целое число
number = input("Введите число: ")
number_int = int(number)
print(f"Тип данных: {type(number_int)}")

# Задача 3: Вывод возраста
age = input("Введите ваш возраст: ")
print(f"Вам {age} лет.")